#include <stdio.h>
#include <stdlib.h>

/* run this program using the console pauser or add your own getch, system("pause") or input loop */

int main(int argc, char *argv[]) 
{
	
	return 0;
}
/*
在计算机系统中用来表示数据信息的最小单元就是一个2进制数0或1 就是一个位              1Byte=8bit   一字节=8位 
程序运行中间，不能变化的量叫常量，另外一些量可以由程序或用户单独进行访问读取或修改
k e3  
m e6
g e9
t e12

常量分为了，
1.整型常量 
2.实型常量         en表示10的n次方，例e5即为10^5 
3.字符常量        在字符上加入单引号，里面有且只有一个 
4.字符串常量      在字符里加入双引号 里面有一个或多个    
5.符号常量        #define PI 3.1415925  可以做到一改全改 
"a"  字符串会自动加上结束标记\0，结束占一个字节，字符串一个字节，所以"abc"为4个字节 abc 三个 结束\0一个
 所以会多出一个字节   
'a'   单引号不会加入 结束标记 
 
标准科学计数法，小数点前面以为是0，小数点后面以为不是0.

变量代表一个有名字的，具有特定属性的一个存储单元，变量用来存放数据，也就是存放变量的值
当定义变量的时候系统会为每一个变量 
常变量  const int a=5 定义a为一个指定变量，指定其值为5，而且在变量存在期间其值不能改变
标识符只能由字母数字或下划线3种字符组成，且第一个字符必须为字母或下划线 


正整数补码即原码
负整数补码即反码+1
反码是去掉符号位0换为1  1换为0
 

整形数据是以补码的方式存在 
字符型数据是以ASCII码存在 
二进制计数范围为2^n  一个字节8位所以2的8次方 所以一个字节的计数范围位0~255      16进制 65535 
int整形         2Byte   -32768  32767 
float实型       4Byte
cher字符型      1Byte 




字符型数据
 'a' 97   
 'A' 65   01000001 
某个字符加上单引号以后就是一个字符常量 


*/

